
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 11 to add, 3 to change, 11 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.servicebus_primary_connection_string
  * azurerm_key_vault_secret.servicebus_primary_shared_access_key
  * module.vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
  * module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule
  * module.servicebus-queue-request.azurerm_servicebus_queue.servicebus_queue
  * module.servicebus-queue-request.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.servicebus-queue-request.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.servicebus-queue-response.azurerm_servicebus_queue.servicebus_queue
  * module.servicebus-queue-response.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.servicebus-queue-response.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription
  * module.servicebus-topic.azurerm_servicebus_topic.servicebus_topic
  * module.servicebus-topic.azurerm_servicebus_topic_authorization_rule.send_listen_auth_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.servicebus_primary_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "servicebus_primary_connection_string" {
        id             = "https://hmc-aat.vault.azure.net/secrets/hmc-servicebus-connection-string/475994b8ec5b4ad6973799e6d3afa580"
        name           = "hmc-servicebus-connection-string"
        tags           = {}
      ~ value          = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.servicebus_primary_shared_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "servicebus_primary_shared_access_key" {
        id             = "https://hmc-aat.vault.azure.net/secrets/hmc-servicebus-shared-access-key/3fd24970b5d241258eed74c523d92aa4"
        name           = "hmc-servicebus-shared-access-key"
        tags           = {}
      ~ value          = (sensitive value)
        # (4 unchanged attributes hidden)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace must be replaced
-/+ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
      ~ capacity                            = 0 -> 1
      ~ default_primary_connection_string   = (sensitive value)
      ~ default_primary_key                 = (sensitive value)
      ~ default_secondary_connection_string = (sensitive value)
      ~ default_secondary_key               = (sensitive value)
      ~ id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat" -> (known after apply)
        name                                = "hmc-servicebus-aat"
      ~ sku                                 = "Standard" -> "Premium" # forces replacement
        tags                                = {
            "BuiltFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git"
            "Destroy Me"          = "No"
            "Team Contact"        = "#ccd-devops"
            "application"         = "core-case-data"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#ccd_support"
            "environment"         = "staging"
            "managedBy"           = "CDM"
        }
      ~ zone_redundant                      = false -> true # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_namespace_authorization_rule" "send_listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/AuthorizationRules/SendAndListenSharedAccessKey" -> (known after apply)
        name                              = "SendAndListenSharedAccessKey"
      ~ namespace_id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat" -> (known after apply) # forces replacement
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-queue-request.data.azurerm_servicebus_namespace.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_servicebus_namespace" "this"  {
      ~ capacity                            = 0 -> (known after apply)
      ~ default_primary_connection_string   = (sensitive value)
      ~ default_primary_key                 = (sensitive value)
      ~ default_secondary_connection_string = (sensitive value)
      ~ default_secondary_key               = (sensitive value)
      ~ id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat" -> (known after apply)
      ~ location                            = "uksouth" -> (known after apply)
        name                                = "hmc-servicebus-aat"
      ~ sku                                 = "Standard" -> (known after apply)
      + tags                                = (known after apply)
      ~ zone_redundant                      = false -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.servicebus-queue-request.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-to-hmi-aat" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "hmc-to-hmi-aat"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat" -> (known after apply) # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.servicebus-queue-request.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-to-hmi-aat/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-to-hmi-aat" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-queue-request.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-to-hmi-aat/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-to-hmi-aat" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-queue-response.data.azurerm_servicebus_namespace.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_servicebus_namespace" "this"  {
      ~ capacity                            = 0 -> (known after apply)
      ~ default_primary_connection_string   = (sensitive value)
      ~ default_primary_key                 = (sensitive value)
      ~ default_secondary_connection_string = (sensitive value)
      ~ default_secondary_key               = (sensitive value)
      ~ id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat" -> (known after apply)
      ~ location                            = "uksouth" -> (known after apply)
        name                                = "hmc-servicebus-aat"
      ~ sku                                 = "Standard" -> (known after apply)
      + tags                                = (known after apply)
      ~ zone_redundant                      = false -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.servicebus-queue-response.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-from-hmi-aat" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "hmc-from-hmi-aat"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat" -> (known after apply) # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.servicebus-queue-response.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-from-hmi-aat/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-from-hmi-aat" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-queue-response.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-from-hmi-aat/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/queues/hmc-from-hmi-aat" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_servicebus_topic" "this"  {
      ~ auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ default_message_ttl                     = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ duplicate_detection_history_time_window = "PT10M" -> (known after apply)
      ~ enable_batched_operations               = false -> (known after apply)
      ~ enable_express                          = false -> (known after apply)
      ~ enable_partitioning                     = false -> (known after apply)
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat" -> (known after apply)
      ~ max_size_in_megabytes                   = 1024 -> (known after apply)
        name                                    = "hmc-to-cft-aat"
      ~ requires_duplicate_detection            = false -> (known after apply)
      ~ status                                  = "Active" -> (known after apply)
      ~ support_ordering                        = false -> (known after apply)
        # (2 unchanged attributes hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ id                                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat/subscriptions/hmc-subs-to-cft-aat" -> (known after apply)
        name                                      = "hmc-subs-to-cft-aat"
      ~ topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat" -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.servicebus-topic.data.azurerm_resource_group.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_resource_group" "this"  {
      ~ id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat" -> (known after apply)
      ~ location = "uksouth" -> (known after apply)
        name     = "hmc-shared-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/hmc-shared-infrastructure.git"
          - "Destroy Me"          = "No"
          - "Team Contact"        = "#ccd-devops"
          - "application"         = "core-case-data"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#ccd_support"
          - "environment"         = "staging"
          - "managedBy"           = "CDM"
        } -> (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.servicebus-topic.data.azurerm_servicebus_namespace.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_servicebus_namespace" "this"  {
      ~ capacity                            = 0 -> (known after apply)
      ~ default_primary_connection_string   = (sensitive value)
      ~ default_primary_key                 = (sensitive value)
      ~ default_secondary_connection_string = (sensitive value)
      ~ default_secondary_key               = (sensitive value)
      ~ id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat" -> (known after apply)
      ~ location                            = "uksouth" -> (known after apply)
        name                                = "hmc-servicebus-aat"
      ~ sku                                 = "Standard" -> (known after apply)
      + tags                                = (known after apply)
      ~ zone_redundant                      = false -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.servicebus-topic.azurerm_servicebus_topic.servicebus_topic must be replaced
-/+ resource "azurerm_servicebus_topic" "servicebus_topic" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "hmc-to-cft-aat"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat" -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

  # module.servicebus-topic.azurerm_servicebus_topic_authorization_rule.send_listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_topic_authorization_rule" "send_listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat/authorizationRules/SendAndListenSharedAccessKey" -> (known after apply)
        name                              = "SendAndListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
      ~ topic_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat|hmc-aat"
        name                       = "hmc-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
        # (1 unchanged block hidden)
    }

Plan: 11 to add, 3 to change, 11 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vault.azurerm_monitor_diagnostic_setting.kv-ds has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.KeyVault/vaults/hmc-aat|hmc-aat"
        name                       = "hmc-aat"
        # (2 unchanged attributes hidden)

      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":22,"Program":"tfcmt","SHA1":"","Vars":{}} -->